tutorials/multiRegion/film/splashPanel/0/film/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    surface
    {
        type            coupledTemperature;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
